{
  "timelogs" : [ {
    "date" : "10-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "12:55\n#coding--timelog created initial version of vision board\n12:15\n#myinstagram distracted by instagram again! What I really need to do is apply to jobs so I can get closer to my goal of $5000k a month\n11:55\n#coding--timelog refining the text parsers components!\ng& grateful for that shop that makes those delicious sticky rice and egg custard cakes wrapped in banana leaves &g\ng& grateful for the good luck that led to me meeting Jeff. Really like working with him and on the educational platform! &g\n10:35\n#timelog updating\n10:25\n#clientwork--asfamous uploaded posts and stories to Instagram and Facebook; reposted on Soi Krung Thai and added photos to Google Business. Prepped some more posts for the next couple of days!\n9:20\nbreakfast with Baow f& 2x sticky rice w/ egg custard + yellow rice and chicken from the muslim restaurant &f\n8:50\n#myinstagram adding story\n8:40\n#clientwork--elephantenglish updating the documents tab on the teachers account page\n5:25\n#myinstagram updating stories\n5:17\n#clientwork--elephantenglish debugging, ran into issue at the launch of the application and had to reset password on mySQL l& reset mysql password by going to system preference mysql and then 'initialize database' then run php artisan migrate:fresh --seed to create a database again in sequel pro &l\n5:05\n#myinstagram responding to DMs\n4:50\n#wakingup woke up with Alarmy app. Listened to Tom Bilyeu podcast while cleaning aparment w& 66.6 kg &w h& 8 min abs &h\n4:00"
  }, {
    "date" : "09-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "\n15:40\n#clientwork--dmt posting post on Diamond Instagram and responding to DMs\n15:08\n#questionsforchelsea creating questions for chelsea\n14:55\n#personalbranding editting photos for my personal instagram and moving onto laptop \n14:05\n#gettingdressedforgym putting on gym clothes and braiding hair.\n13:50\n#clientwork--asfamous organizing content on hard drive to become more efficient in posting\n12:45\n#myinstagram updating stories\n12:35\n#clientwork--asfamous posting content on Instagram, Facebook, IG&FB stories, Google Business.\n12:15\n#watchingonechampionship watching Sangmanee vs. Azize Hlali\n11:45\n#answerdror Dror messaged me asking if I would be interesting in teach 3-4 kids age 10 coding; just replied saying I would be willing to give it a shot\n11:35\n#clientwork--asfamous responding to Mike's inquiry about whether we need more content\n11:25\n#brunchatgym f&gym food and cha qiao&f talked with Matilda about digital nomad life and Vicky about fights. Also talked with Eric @ec_cpt and found that he has had dengue for the past 2 days.\n10:15\n#callingmom mom called while I was on a run; calling her back now! h&called mom&h\n9:10\n#myinstagram respond to personal DMs in primary inbox\n8:40\n#messagechelsea message chelsea on instagram and ask if you can meet with her sometime today or tomorrow with regards to making a decision about Vietnam.\n8:35\n#timelog updating timelog and adding to do list\n8:25\n#messagelandlord messaging landlord \n8:15\n#breakfast f&2x purple rice and egg custard wrapped in banana leaf &f g&grateful to baow for going to the market and buying me breakfast without me asking&g\n8:07\n#postrun shower, wash clothes, hang up clothes\n7:47\n#running h&run: 6km&h l& when uploading instagram stories, check to make sure story has loaded first before closing out &l\n7:06\n#prerun get dressed for run\n6:55\n#timelog updating timelog\n6:50\n#myinstagram adding a story about learning thai\n6:43\n#studythai study thai for one hour one hour on flashcard app; up 69 points; accidentally deleted a bunch of vocab from notes but learned my lesson l& always copy thai vocab from apple notes; avoid cutting in case you paste over the clipboard and lose the data. There is no easy way to go in clipboard history and no easy way to go in apple notes history &l \n5:35\n#coding--timelog adding a bit of code to reformat entries for \"learning something new\" and \"ig followers\" - not parsing for it yet though\n5:30\nw&67.7kg&w\n#timelog shoot, I need to add something so that a day gets added even if we don't create anything. For example, I didn't log anything in the timelog yesterday but I will still like to insert things after the case.\n5:19\n#myinstagram updating stories, but also wasn't very intentional and stayed on longer than was necessary igf& 11.2k &igf\n5:00\n#creatingtodolist creating a massive todolist for the day lol\n4:42\n#wakingup yesterday I slept through my alarm so today and then my whole day kind of went to crap so I wanted to make sure that didn't happen today l& immediately after turning off the alarmy math alarm, start listening to entrepreneurship podcasts; it would also help to do your 8 minute abs right away; this should help give you the motivation to stay up &l \n4:00"
  }, {
    "date" : "07-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "\n14:00\n#coding--timelog the text parser components are unfinished but we made progress. Just spent the last 30 minutes trying to figure out a bug, only to realize that there was a simpler solution.\n12:00\n#nap\n11:40\n#baow eat food with Baow and hang out a bit\n11:30\n#social go to gym to eat; f& gym food + 2x rice with egg custard wrapped in banana leaf &f the rain was going pretty hard so we had to wait in the gym for a bit; then went to the muslim restaurant to get some food for Baow and drive back home\n10:00\n#coding--timelog working on the parsed text components\n8:15\n#baow dropping Baow off at the gym and picking up some food f& 1x silat bao + 1x 150 calorie cracker thing &f\n7:45\n#running h& run: 5km &h + shower + shower/wash clothes + hang up clothes\n6:45\nh& abs: 8 min &h starting to get ready for a run w&67kg&w\n6:25\n#myinstagram got distracted by Instagram again\n6:15\n#coding--timelog creating text parser components\n4:45\n#myinstagram was just going to a post a story, but got distracted for longer; I would like to be more intentional when I go on Instagram\n4:15\n#wakingup brush teeth, wash face, get settled\n4:00"
  }, {
    "date" : "05-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "5:48\n#studythai learning how to read the Thai characters seems to be taking me twice as long as memorizing from English to Thai translation. Might be extending my Thai fluency date. Currently it is marked at Nov 18, in 13 days. Before, it was Nov 13. I'm starting to take on more projects now (grow my social media, etc.). Am fine with becoming fluent a little later.\n4:45\n#timelog updating\n4:40\n#selfcare figured out how to reset the breaker! Updated Instagram stories, washed face, and brushed teeth.\n4:30\n#electrictyisout it has been getting easier and easier to wake up at 4 AM! Body is getting used to it. Electricity was out but turned out it it was just the breaker. lsn& learned how to reset the breaker!&lsn\n4:00"
  }, {
    "date" : "04-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "14:00\n#gettingready feeling antsy so am getting dressed for Muay Thai - punching something helps center; I also have to be sure that I'm not procrastinating.\n13:43\n#thingsivebeenavoiding checked wells fargo bank balance wf&365.35: just paid off all of credit card debt &wf communicated with Jesse about getting refund for the Samui Visa Extension\n13:25\n#misc h&checks: 50&h and updating timelog\n13:15\n#myinstagram responding to DMs\n12:55\n#clientwork--elephantenglish communicating with Jeff on Slack; asking him what the next steps are\n12:45\n#clientwork--dmt organizing content - communicating with Simon about the website and helping Jesse give a student Helen the Wifi password.\n11:55\n#timelog updating\n11:45\n#clientwork--dmt h&posted dmt: koh raham swing&h answered DMs. Reposted stories.\n11:14\n#social went to the gym to get food. Sat with Megan, her boyfriend, Matilda. Ate pretty fast and then went to fetch Baow behind the gym. Saw Tean and the other Baow cleaning out a chicken! Came back with Baow and ate Khanom Thai. Then messed around a bit <3 and had a shower.\n10:10\n#clientwork--asfamous h&posted asfamous: apple pie&h added stories; posted to Soi Krung Thai; added apple photo to Google Business Photos\n9:30\n#myinstagram adding stories to update about my day\n9:00\n#clientwork--dmt getting content off my phone and organizing it\n8:35\n#clientwork--asfamous getting content off my phone and organizing it\n8:15\n#baow messing around with Baow and then slipped on the steps and fell on my bum! g& grateful for the hardware engineers at apple for designing a such a hard screen; I smashed my screen pretty hard against the steps pretty hard falling down but there's not even a scratch! &g \n8:00\n#clientwork-asfamous moving content of of my phone and organizing it in folders in external hardrives\n7:30\n#clientwork--dmt moving content off of my phone and organizing it in folders in external harddrives\n7:13\n#plannambassador there is an opportunity to be a plann ambassador! If I like the app the next couple of days I might take it! Also resending an email to Livia that didn't look to have sent\n7:00\n#mom video call with Mom! She has been walking alot. Yesterday she walked 8 miles with Werner omg haha. She just wanted to check in to make sure that I was okay!\n6:32\n#myinstagram installing Plann and figuring out how to use it\n6:05\n#myinstagram figuring out how to download presets onto adobe lightroom mobile app and editting my 5 instagram photos\n4:50\n#slowwakeup h&abs: 8 min&h w& 67.9kg &w -- shower, wash face, listen to GaryVee.\n4:00"
  }, {
    "date" : "03-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "16:30\n#coding--timelog perfecting the clientwork parsing, made a ton of progress! Next is to work on the week by week breakdown. Committed to Github. It has been a while since I've done that.\n13:25\n#timelog updating timelogs\n13:10\n#showerandselfcare shower and wash clothes\n12:55\n#running h&run:4km&h\n12:30\n#cleaningup a bunch of small ants decided to make their nest\n12:00\n#nap was going to go for a run but fell asleep on the bed instaed\n11:30\n#clientwork--elephantenglish converting components to Vue\n10:15\n#brunch f&yellow rice and chicken and khanom thai&f baow phoned ahead and went to pick up food.\n10:00\n#clientwork--elephantenglish figuring out how to convert components to Vue\n7:00\n#snacks f&peanuts and 2 chocolate cracker things: 560 calories&f $&peanuts and 2 chocolate cracker things from family mart: 20 baht&$\n6:50\n#clientwork--elephantenglishlearning communicating with Jeff and Slack; asking him questions; reading Laravel documentation.\n5:30\n#coding--timelog Reactjs -- cleaning up timelog project\n4:30\n#selfcare h&abs:8 min&h\n4:00"
  }, {
    "date" : "02-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "\n21:00\n#timelog updating timelog; there was quite a lot to write today!\n20:45\n#myinstagram posting updated stories\n20:20\n#clientwork--asfamous h& posted asfamous: hi so bagel &h\n20:00\n#clientwork--dmt posting fight updates about Vicky and Frederico, updating stories, responding to messages &h posted dmt: fight updates for vicky and frederico &h\n19:10\n#selfcare got back home and showered while Baow when to get f&khanom thai&f\n19:00\n#social dinner at the gym and talked with the fellow whose girlfriend got accepted to study in South Africa and who used to work as a product manager but is now traveling the world f&gym food&f\n18:00\n#exercise h&knees in the air: 100 &h\n17:35\n#exercise h&7.5kg weights: 100 lifts&h\n17:30\n#exercise h&checks: 100&h\n17:25\n#exercise h&jump squats:50&h\n17:20\n#clientwork--dmt posting stories\n17:00\n#running h&run: 4km&h reached the goal of 7km total today!\n16:30\n#myinstagram posting stories and responding personal messages\n16:15\n#clientwork--elephantenglishlearning laravel instagram clone. Finished!\n14:00\n#nap fell asleep. Probably due to waking up at 3 AM.\n12:00\n#clientwork--elephantenglishlearning laravel instagram clone f& khanom thai &f\n11:00\n#social go to the gym and eat food; talked with the woman with the black hair and green eyes who is a london based freelance filmmaker; found out about this meditation retreat place that she went to for 7 days in Koh Samui; Baow waited for me and got khanom thai for us in the meantime f& gym food&f\n10:20\n#running 2km h&run: 2km&h\n9:55\n#cleaning cleaning up apartment, listening to podcasts and recentering\n9:30\n#clientwork--elephantenglishlearning laravel instagram clone\n8:10\n#distracted by looking at presets on Google\n7:50\n#clientwork--elephantenglishlearning laravel instagram clone\n7:15 \n#myinstagram got distracted\n7:00\n#clientwork--elephantenglishlearning laravel instagram clone\n6:10\n#errands filling up water bottles and getting snacks $& 13 baht water and 2 chocolate things&$ f& 2 chocolate cracker things: 300 calories&f\n6:00\n#clientwork--elephantenglishlearning laravel instagram clone\n5:10\n#studythai bathroom break + studying thai; up to 64 points!\n4:40\n#clientwork--elephantenglishlearning laravel instagram clone\n3:25\n#selfcare nice warm shower\n3:10"
  }, {
    "date" : "01-11-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "21:00\n#unwind\n18:00\n#muaythai\n16:00\n#gettingready getting ready for the gym!\n15:30\n#baow <3\n15:10\n#clientwork--elephantenglishlearning learning Laravel by building Instagram clone in Laravel\n13:45\n#selfcare filling up waterbottles $& fill up water bottles and instant noodles: 12 baht &$ f& instant noodles &f\n13:22\n#nap\n12:50\n#clientwork--elephantenglishlearning learning Laravel by building Instagram clone in Laravel\n12:25\n#clientwork--asfamous h& posted asfamous: fruit shake help up in front of as famous sign &h\n12:00\n#gettingorganized updating timelog - this took a bit because I wanted to document yesterday afternoon as well!\n11:45\n#Baow Baow came back from visiting the bank with more sweets! yum f& four small cups of sweet coconut jelly &f\n11:40\n#clientwork--dmt h& posted dmt: kru mon holding pads for kru chok &h posted content; updated stories; responded to messages\n11:05\n#social go to the gym to eat and to talk with the other DMT students! there were 2 fellows and 4 women, including Matilda. Holly came to join us for a bit!\nf& gym food &f\nf& 2x family mart chocolate cracker flakes: 110 calories &f\n10:20\n#clientwork--elephantenglishlearning learning Laravel by building an Instagram clone in Laravel\n8:30\n#running h& run:4km&h\n8:00\n#clientwork--elephantenglishlearning learning Laravel by building an Instagram clone in Laravel\n4:30"
  }, {
    "date" : "31-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "21:00\n#unwind came back home with Baow, &f khanom thai dessert &f got our usual dessert vices of sticky rice with egg custard and then I remember I started building a nutrition website for fun and then fell asleep at around 9:30pm\n19:00\n#social had dinner at the gym. There weren't a lot of people I recall. Don't entirely recall who was there. f& gym dinner &f\n18:10\n#payment from Mike picked up a payment from Mike of 5000 baht for the second half of the website and 5000 baht for the second two weeks of October. I asked for 4000 but Mike have me 5000. He is so nice! \n17:50\n#running h& run: 5km &h\n17:20\n#unlogged not sure I remember what I did...\n16:05\n#stuff went off with Baow in search of a fan f& two chocolate cracker things: 160 calories &f\n15:10\n#clientwork--elephantenglishlearning f& crackers: 380 calories &f\n14:36\n#studythai pretty hard now because am trying to read the Thai characters so it is taking me longer; up to reached my goal of 100 points today though!\n13:25\n#nap feeling very tired after Muay Thai training. Woke up after a bit, craving snacks but I know that I'm not hungry so I think it's more a distraction that I'm craving. Glad I'm not ceding to watching Youtube though! Getting things cleaned up and updating timelog!\n12:45\n#clientwork--asfamous h&posted asfamous: halloween post&h\n12:00\n#baow Baow bought some khanom thai; eat and relax with Baow\n11:30\n#clientwork--dmt went to pick up Baow and there was the fellow from Belgium Siebe with his wife/girlfriend who was wrapping us a private with Baow. And then a fellow named Darren Kelly popped up and asked if his room was available today so I said that I would check with Jesse. Also responded\n11:00\n#social talk to the two russian fellows. Learned that the one with the longer face's name is Eyal? Or something like that. Yuri is the friend. There was also the fellow who was going to do the 21 day meditation and another younger fellow. f&gym food&f\n10:00\n#muaythai h&squats:100&h h&lift weights--7kg:100&h h&run: 2km&h\n8:00\n#clientwork--dmt h& posted dmt: chok technique post &h \n7:45\n#clientwork--asfamous h&posted asfamous: espresso video&h\n7:30\n#coding--timelog working on my parsing habits method\n6:50\n#selfcare wake up; sweep, clean up desk; listen to Lisa Bilyeu h&abs: 8 min&h; h&muay thai checks: 100&h\n6:00 "
  }, {
    "date" : "30-10-2019",
    "objectives" : "TOP THREE:\nSet up Alarmy alarm to wake up at 4 AM--DONE\nWork 1 hour on personal website\nStudy Laravel for 2 hours",
    "rawEntry" : "20:05\n#clientwork--elephantenglishlearning drove over to the teams house and sat with Jeff while we learned to migrate things to the \n14:05\n#clientwork--asfamouswebsite managed to log in to the admin system and added the template! Page is now live!\n12:05\n#clientwork--liviawebsite making the modifications Lisanna requested and assessing feasibility of other requests. Communicating with Lisanna through Whatsapp.\n11:35\n#clientwork--asfamouswebsite trying to log in again to admin portion but it is saying that it is the wrong password\n11:25\n#selfcare getting situated\n11:10\n#clientwork--dmt communicating with a potential student who wanted a private h&muay thai checks:100&h\n11:00\n#jobsearch communicating with Jeff with regards to the meeting this afternoon\n10:50\n#eating at the gym\n10:10\n#run h&run: 3km &h\n9:45\n#clientwork--dmt h&posted dmt&h prepped post for the afternoon because didn't post yesterday. Added to IG stories. Responded to DMs. Forwarded an inquiry to Simon. Moved some content to the hard drive.\n8:45\n#myinstagram adding stories, need to respond to DMs!\n8:30\n#clientwork--asfamous h&posted asfamous&h prepped post for this afternoon because I did not post yesterday. Also added photos to Google business photos. Replied to Miriam's email. Edited the post for this afternoon to include footage of coffee roasting.\n7:25\n#coding-timelog adding a habits parser to personal project\n6:40\n#selfcare talking with Baow; woke up naturally early. Set up the Alarmy alarm for 4 AM everyday. We'll see if it works! h&abs: 8min&h\n4:42"
  }, {
    "date" : "29-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "11:30\n#coding-timelog fixing bugs\n11:20\n#studythai getting back up to 100+ points!\n11:00\n#social went to the gym to get food and talked with Megan and her boyfriend!\n10:00\n#studythai studied but lost all my data again. Feeling frustrated.\n9:20\n#coding fixing bugs\n8:20\n#studythai\n8:00\n#baow have not been exactly the most productive\n7:00"
  }, {
    "date" : "28-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "13:45\n#coding--flashcards making it so that in the level 4 and level 5 cards show up thai side first!\n13:10\n#myinstagram got distracted by IG again!\n13:00\n#studythai reached me goal of 100+ points today!\n12:25\n#myinstagram got distracted \n12:00\n#clientwork--dmt posted content for Instagram. Reposted stories. Answered messages!\n11:30 \n#clientwork--asfamous posted content for the day on Instagram/Facebook.\n11:00\n#unproductive Baow came back yesterday; Woke up today late but happy. After dropping Baow off I ceded to my urge of buying a box of chocolate cakes and eating the whole thing while watching Jacksepticeye. Picked up Baow at the gym and then we went to go buy some cha qio and kai nok katta. He also went to the gym to pay off his car loan.\n7:00 "
  }, {
    "date" : "27-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "\n16:20\n#meditate\n16:10\n#youtube--jacksepticeye\n15:40\n#trysomethingnew--hike tried to hike the khao ra but kept on hearing thunder so I decided to climb back down to be safe; went to the market and bought [$35 baht: 2 chicken sticks; bread loaf with sweet filling $]\n14:10\n#clientwork-dmt posted content\n13:55\n#clientwork-asfamouswebsite tried logging into website but was unable to. Says that the username is invalid.\n13:38\n#studythai got up to 105 points!\n12:35\n#clientwork--liviawebsite completing all of Lisanna's requested changes\n11:30\n#youtube watch a lostleblanc video\n11:15\n#shower\n11:00\n#clientwork--asfamous posting menu for today and changing to hours on Google business; responding emails and updating the default caption bottom;\n10:30\n#clientwork--liviawebsite -- answering messages\n10:15\n#clientwork--asfamous preparing content\n10:00\n#timelog updating; forgot to update yesterday as well so this is taking awhile; also went to family mart [$22 baht: pack of crackers, spicy peas$]\n9:36\n#selfcare unwinding \n9:22\n#applyjobs--hackerank taking the challenge\n7:17\n#applyjobs--studyingforhackerank studying for Hacker Rank and freaking out. Watching Youtube videos on advanced React; had a phone call with Mom where I freaked out to her; posted some stories to Instagram.\n6:04"
  }, {
    "date" : "26-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "21:29\n#studyingforhackerank\n19:43\n#myinstagram posting/watching stories and eating\n18:46\n#running 4km run + get food at the gym\n18:00\n#clientwork-asfamous posting for A's\n17:45\n#clientwork-dmt posting post for Diamond\n17:30\n#cleaningapartment\n16:30\n#selfcare shower, eat, unwind, call Baow, answer messages\n15:30\n#coding--laravelwithjeff installing all of the necessary packages\n11:00\n#foodandsocialize eat food at the gym and waiting for jeff to answer messages.\n10:30\n#running 7km loop run/walk\n8:40\n#clientwork--dmt filming some stories for Diamond\n8:20\n#dontremember\n7:20\n#coding--timelog\n5:45"
  }, {
    "date" : "25-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "21:40\n#gettingreadyforbed; feeling pretty pooped. Am going to see if I can set an alarm for 4AM to work on my personal project for a bit.\n21:36\n#timelog update\n21:23\n#market drive to the market to buy [$20 baht: chicken skewers$]\n21:10\n#myinstagram post stories and respond to some messages\n20:40\n#clientwork-dmt post \n20:25\n#clientwork-asfamous post\n20:10\n#shower\n19:50\n#running 4km run\n19:00\n#dinner saved food at the gym; sat down and talked with Matilda and others at the gym!\n18:10\n#running 2km run\n18:00\n#jacksepticeye binge watch borderlands. That was a cool, funny action game [$12 baht pack of crackers$]\n12:00\n#samuivisaextension ; 300 ferry ticket + 150 bus + 100 passport + copies + 1900 fee + 250 ride back + 250 ferry ticket = [$2950 baht: visa extension$] [$17 baht: coffee $]\n6:30\n#sleep\n4:20\n#laravel running into some issues for upgrading laravel on my laptop. Prepared email for Jeff and set a reminder to ping him at 8AM today\n3:15 \n#trippreparation listening to Patt Flynn and researching what I need for Samui; prepping backpack\n3:05\n#selfcare washing face, cleaning up, feeling a little better but have a headache\n2:30"
  }, {
    "date" : "24-10-2019",
    "objectives" : "No objectives written yet",
    "rawEntry" : "19:30\n#youtube immediately felt unmotivated and just lied down on the bed and starting playing a Jacksepticeye youtube video\n19:00\nCouldn't eat so brought the food back home\n18:00\n#muaythai felt sick AF haha\n16:00\n#mattcave help matt cave film the running scene\n15:35\n#clientwork--liviawebsite implementing changes requested by Lisanna\n14:50\n#myinstagram posting another instagram update\n14:40\n#selfcare getting dressed for Muay Thai and setting top three goals for the day\n14:20\n#myinstagram uploading stories\n14:00\n#myinstagram respond to DMs\n13:40\n#clientwork--dmt respond to messages; forward some inquiries; post daily content\n13:00\n#timelog update timelog\n12:53\n#selfcare--erands go pick up laundry; hang up; answer whatsapp messages\n12:35\n#clientwork--asfamous creating content from yesterday's footage\n11:02\n#selfcare [$150 baht: fill up gas tank$] [$30 baht: cha qiao$]\n10:30\n#social go to the gym to get food and chat with Matilda, Rachel and Vickyl. Briefly see Christina\n10:06\n#clientwork--asfamous creating content from yesterday's footage: espresso, espresso shake and salmon bagel\n8:50\n#timelog updated\n8:47\n#selfcare made coffee, fed cat, cleaned up a bit; \n8:30\n#nap feeling tired\n8:16\n#studythai restudying the flashcards. Found a much more efficient way by going straight to deck\n8:00\n#coding--flashcards fixing a bug that deleted all my data!\n6:46\n#studythai at +102 points already. Wow, my brain really remembered well today!\n6:05\n#selfcare wake up + shower, shampoo hair\n5:42 AM"
  }, {
    "date" : "23-10-2019",
    "objectives" : "smaller objectives\nanswer miriam's email\nupdate timelogs for yesterday\nwatch pawan's video",
    "rawEntry" : "22:30\n#timelog updating about the day - have a bunch of client work to get to tomorrow morning! Logging my expenses today. I spent [$-75 baht: hangers, clothes clips, a small notebook, and a small wallet//20 baht store$] , then [$-288 baht: toilet paper, pack of instant coffee, underwear liners, body wash soap//tesco$] and then [$20 baht: pack of cookies, soy milk//family mart $]\n22:05\n#myinstagram messaging Matt to apologize for not showing up at 3:45 pm. Responding to more DMs on Instagram and starting to feel that addiction to compulsively check Instagram for a dopamine hit again. \n21:44\n#selfcare cleaning up\n21:21\n#myinstagram responding to DMs\n20:45\n#myinstagram adding a story update about the interesting day today\n20:10\n#selfcare went home took a shower and called baow\n19:00\n#social drove back to the gym and had dinner and hung around at Mama's afterwards and chatted with the students there. Stayed until around 7\n18:15\n#gettingpaid--asfamous forgot to go pick up the payments and then saw a message from Mike. He gave me [$+4000 baht$] for the first week of October and then an additional [$+5000$] down payment for the website. He's so nice!\n18:10\n#muaythai shadowboxing on my own for a bit while listening to music\n17:50\n#social talking to Holly and Vicky\n17:30\n#running drive to the gym, saw Liz. Ran the 7km loop \n16:40\n#selfcare getting ready for run\n16:30\n#clientwork--liviawebsite Lisanna phone call\n15:20\n#potentialnewclient potential new client\n12:50\npick up Baow and drop him off at the ferry\n12:45\n#clientwork--asfamous doing content creation work at the restauarant\n10:40AM\n#selfcare--errands went and bought a bunch of items I wanted and then drove to the gym to eat brunch and pick up Baow. Baow was in a bad mood because the gym had promised to pay him in advance so that he could go to the hospital but they didn't have the money when he came to them that morning\n9:45\n#timelog update timelogs for today\n9:43\n#selfcare--shower--get dressed shower, put on makeup, \n9:18\n#selfcare--cleaning deep cleaning + listening to Unf*ck Your Brain; making a list of items I want to get when I go to run errands.\n8:22\n#mysinstagram answer private messages that gathered up over the night\n8:08\n#selfcare--cleaning shower and drop Baow off at the gym\n7:40\n#baow <3\n7:20"
  }, {
    "date" : "22-10-2019",
    "objectives" : "BIG THREE OBJECTIVES #bigthree\n- #remote Submit one job application for a remote React position - DONE\n- #update create a \"progress update\" for Flashcard app content for Instagram/Facebook/LinkedIn/Youtube/Medium. Try to create for all these platforms but focus on Instagram and LinkedIn\n- #dm respond to all DMs - cap it off at 2 hours.\n\nOTHER OBJECTIVES\n- set alarm for phone call with Lisanna tomorrow\n- watch Pawan's video\n- code out vision board on timelog project\n- code out food log on timelog project\n- code out gratitude diary on timelog project\n\nDAILY OBJECTIVES #daily\npost for A's Famous -- DONE \npost for Diamond -- DONE\nget 100 points in Flashcard app -- DONE\n\n",
    "rawEntry" : "15:05\n#personalbranding--bigthree create a \"progress update\" for Flashcard app content for Instagram\n13:26\n#clientwork--asfamous made a change to the contact forms as requested by Livia and replied to her email!\n13:05\n#applyjobs--namaste--bigthree submitted job application for Namaste!\n12:04\n#clientwork--asfamous posted beef burritos for A's!\n11:54\n#baow Baow <3 + shower\n11:23\n#studythai eat food and study thai; up to 109 points! [8 gym morning meal 8]\n10:35\n#food went to get food! also went to buy cha qiao for Baow and I. [$55 baht for cha qiao$] [$45 baht for 9 packets of electrolytes$]\n10:15\n#clientwork--dmt adding more stories to the Diamond instagram!\n10:05\n#communications answering Cesar's message about his first smoker and checking in with Vicky after her fight\n9:59\n#selfcare--brushed hair to get ready to go to the gym to get food; cleaning up apartment and opening up windows to air out\n9:40\n#clientwork--dmt just finished posting on Diamond. This post took me some time because I wanted to have a good cover image for the video files so I spent some time on canva creating it. Will definitely be able to reuse this though! :) also some time responding to DMs. Organizing footage and moving to laptop. Interesting how creating int\n8:24\n#studythai had a stomach ache so studied thai some more in the bathroom (tmi lol) up to 60 points\n8:11\n#studythai up to 53 points; there are definitely some bugs with the selection process with the flashcard app. I think I'm going to remove the IDs and make it so that the names can't be duplicates. [8 nam tao hoo and 4 badongo 8]\n7:31\n#selfcare went to fill up water bottles, buy nam tao hoo and purchase supplies from the 20 baht store; the 20 baht store was closed so just filled water bottles and bought nam tao who for Baow and I $50 baht$\n7:04\n#selfcare hang up clothes, make a plan to go out and do errands. Update timelogs.\n6:55\n#shower and wash clothes i nshower\n6:43\n#running 5km and listening to Garyvee\n6:13\n#selfcare brain is still feeling out of it so am going to get ready for a run to clear my head\n6:06\n#timelog setting objectives for the day\n6:00\n#clientwork--dmt looking for footage of Roshanne and Vicky on IG stories. Created some clips. Checking Vicky's social media to see how she did.\n5:40\n#selfcare--5minabs woke up in a weird state of mind; it's taking me a little longer than usual to get prepped for the day. Washed face, brushed teeth. Listening to Garyvee. Did 5 minutes of abs. Checked Instagram a bit to see if Roshanne had replied.\n5:00"
  }, {
    "date" : "21-10-2019",
    "objectives" : "TOP THREE OBJECTIVES #bigthree\nWork 1 hour on job application for Namaste\nBlock 1 hour for working on personal description on LinkedIn -- IN PROGRESS - worked 20 minutes on it and am feeling pretty satisfied. I think the next step will be to start applying for remote developer jobs and then start creating content for posting.\nGo to Muay Thai training in the afternoon today -- DONE\n\nSMALLER OBJECTIVES #todo\nrespond to email from that photographer -- DONE (24 minutes)\nrespond to Mike -- DONE (8 minutes)\n\n30 minutes responding to personal DMs on IG\ncreate Instagram content about your progress on the time tracker\nwatch Pawan's video\ncode out vision board on timelog project\ncode out food log on timelog project\ncode out gratitude diary on timelog project\n\nDAILY OBJECTIVES #daily\npost for A's Famous -- DONE (16 minutes)\npost for Diamond -- DONE (20 minutes)\nget 100 points in Flashcard app -- DONE (1h10min)",
    "rawEntry" : "21:54\n#selfcare calling it a night and shutting off technology!\n21:52\n#applyjobs--working on my job application for Namaste; goal is to submit the application tomorrow evening!\n21:10\n#baow going with baow to the pharmacy to get mouth medicine\n21:00\n#applyjobs\n20:28\n#linkedin--bigthree accepted all of the connect request on my profile\n20:20\nupdating #timelog\n20:13\n#studythai--todo got up to 106 points!\n19:58\n#selfcare--baow get dessert with Baow. drive home; shower; wash clothes; hang clothes; eat dessert; relax a bit\n18:49\n#social talking to the couple from long island who are the only fighters at their cardio kickboxing gym. They currently both work for their gym owner but are trying to get out of it\n18:10\n#muaythai--bigthree had a great training! Everyone was so nice. Smiling as per usual. The class was packed.\n15:45\n#linkedin--bigthree updated my LinkedIn description before afternoon training!\n15:21\n#selfcare--skinnyconfidential - getting dressed for Muay Thai; drinking water; cleaning up apartment; Listening to the Skinny Confidential\n15:03\n#coding--flashcards figuring a bug that turned out to be two duplicate flashcards with the same ID\n14:45\n#selfcare movementbreak; helping Baow hang up clothes; doing braids\n14:10\n#coding--timelog making some small improvements; fixed textarea heights and added ability to disable buttons\n13:51\n#clientwork--asfamous posting new content, adding to stories\n13:35\n#clientwork--liviawebsite responding to Lisanna's message and implementing small change she requested with the columns\n13:16\n#clientwork--asfamous responding to Mike\n13:08\n#freelancing--communication--todo responding to Nicki Silvanus photographer's email\n12:44\n#timelog updating activity; updating objectives\n12:35\n#studythai--todo and eating; up to 82 points + 14 new terms\n11:44\n#selfcare shower hang up clothes to dry\n11:23\n#running 4km \n10:47\n#selfcare getting ready for run\n10:44\n#clientwork--dmt responding to DMs. Can't go home yet because of rain\n10:30\n#social talking to Matilda about learning the Thai language\n10:20\n#food grabbed food at the gym\n10:17\n#clientwork--dmt posted content; answering DMs\n10:00\n#coding uploading to Github\n9:45\n#timelog updating\n9:43\n#selfcare--amyp shower, wash dishes, sweep, mop floor, put trash outside, get dressed in running clothes, listen to Amy Porterfield\n8:50\n#coding--timelog added an \"objectives for the day\" section -- haven't committed to github yet; going to take a shower and clean a bit\n7:26\n#selfcare brush teeth, brush hair wash face, setting objectives for the day\n7:11"
  }, {
    "date" : "20-10-2019",
    "rawEntry" : "22:40\n#selfcare calm self down by showering and listening to some garyvee\n22:08\n#applyjob stressing over job application for Namaste\n21:40\n#Baow went to go get instant noodles with Baow\n20:44\n#coding--timelog creating version one of the all entries component\n19:03\n#studythai uploaded 41 flashcards to database\n19:00\n#coding--timelog small aesthetic changes\n18:38\n#timelog updating\n18:34\n#selfcare--garyvee listening to Garyvee on Youtube and washing dishes\n18:25\n#badhabits feeling bad and lost. Watching video game playthroughs with Jacksepticeye. Luckily it was a Resident Evil, which was pretty boring to watch and caused me to switch off quickly\n18:09\n#nap\n17:08\n#studythai memorizing flashcards in bed with Baow\n16:20\n#studythai translating terms with Google translate\n16:06\n#food went to market to get food!\n15:17\n#rov\n13:40\n#clientwork--asfamous posting daily content on Instagram; updating google business photos\n13:30\n#clientwork--dmt answering DMs; posting daily post\n13:00\n#selfcare movement break; getting away from being glued to the screen\n12:46\n#coding--timelog committed to github\n11:30\n#food\n11:00\n#coding-timelog\n10:07\n#timelog updating timelog\n10:04\n#selfcare--cleaning got back from run; shower + wash/hang clothes; fill up water bottles, wash dishes, mop floors\n9:20\n#running 6km\n8:45\n#selfcare getting ready for a run\n8:40\n#clientwork--liviawebsite making desktop and mobile changes requested by Lisanna\n7:20\n#clientwork--asfamous sending email with regards to new website; updating website; adding photos to google business\n6:27"
  }, {
    "date" : "19-10-2019",
    "rawEntry" : "20:11\n#Baow enjoying khanom thai - feeling tired; going to call it a night and set a timer for 7 hours which should be at 3am\n19:49\n#Baow went to market to get khanom Thai\n19:15\n#clientwork--asfamous preparing email for A's Famous\n19:08\n#timelog updating timelogs\n19:03\n#food Baow came back with food from the gym! <3\n18:49\n#selfcare got back from run, shower, wash clothes, hang clothes\n18:31\n#running 5.8km\n17:48\n#selfcare getting ready for run\n17:41\n#clientwork--asfamous posted on A's and posted on DMT\n17:04\n#selfcare have headache; cleaning up apartment; listening to podcasts\n16:28\n#coding--pp--timelog\n15:10\n#clientwork--liviawebsite\n14:45\n#selfcare\n14:42\n#clientwork--liviawebsite\n13:15\n#nap\n12:20\n#studythai uploading flashcards; studying some more; might take a nap\n12:13\n#Baow + Shower\n11:54 \n#studythai translating english terms to thai; Baow helps correct\n11:30\n#studythai memorizing flashcards\n10:35\n#coding flashcard\n10:30\n#studythai\n10:10\n#coding--timelog; committing to github\n10:05\n#selfcare clean + shower\n9:42\n#coding--timelog\n9:35\n#myinstagram adding stories\n9:15\n#coding\n6:47\n#selfcare\n6:43\n#coding--timelog\n5:56\nwake up, brush teeth, wash face #selfcare\n5:33"
  } ]
}
